In [2]:
import pymysql
import numpy as np
import pandas as pd
from sqlalchemy import create_engine
pymysql.install_as_MySQLdb()

In [2]:
filename = 'https://datasets.imdbws.com/title.basics.tsv.gz'
df = pd.read_csv(filename, sep='\t', low_memory=False)

df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,\N,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9417423 entries, 0 to 9417422
Data columns (total 9 columns):
 #   Column          Dtype
---  ------          -----
 0   tconst          object
 1   titleType       object
 2   primaryTitle    object
 3   originalTitle   object
 4   isAdult         object
 5   startYear       object
 6   endYear         object
 7   runtimeMinutes  object
 8   genres          object
dtypes: object(9)
memory usage: 646.6+ MB

In [4]:
df.isna().sum()

tconst             0
titleType          0
primaryTitle      11
originalTitle     11
isAdult            0
startYear          0
endYear            0
runtimeMinutes     0
genres            10
dtype: int64

In [5]:
df.dropna(inplace=True)

In [6]:
df = df.loc[(df['startYear'] >= '2000')]

In [7]:
df = df.replace({'\\N':np.nan})

In [8]:
df.dropna(inplace = True)
df.head(10)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
108535,tt0111056,tvSeries,Gensomaden Saiyuki,Gensomaden Saiyuki,0,2000,2001,23,"Action,Adventure,Animation"
137809,tt0142032,tvMiniSeries,Dune,Dune,0,2000,2000,265,"Adventure,Drama,Sci-Fi"
153528,tt0158466,tvMiniSeries,Anne of Green Gables: The Continuing Story,Anne of Green Gables: The Continuing Story,0,2000,2000,185,"Drama,Family,Romance"
155721,tt0160904,tvSeries,MI-5,Spooks,0,2002,2011,60,"Action,Crime,Drama"
158587,tt0163944,tvMiniSeries,Labyrinten,Labyrinten,0,2000,2000,259,"Drama,Thriller"
162018,tt0167701,tvSeries,Randall & Hopkirk (Deceased),Randall & Hopkirk (Deceased),0,2000,2001,50,"Comedy,Crime,Fantasy"
171904,tt0178140,tvMiniSeries,The Wide Net,Det grovmaskiga nätet,0,2000,2000,176,"Crime,Drama,Mystery"
171924,tt0178161,tvSeries,The Secret Adventures of Jules Verne,The Secret Adventures of Jules Verne,0,2000,2000,60,"Adventure,Horror,Sci-Fi"
172767,tt0179051,tvMiniSeries,Ted and Alice,Ted and Alice,0,2002,2002,180,"Comedy,Drama,Romance"
174754,tt0181199,tvMiniSeries,Arabian Nights,Arabian Nights,0,2000,2000,175,"Adventure,Family,Fantasy"

In [9]:
df.loc[(df['titleType'] == 'movie')]

Empty DataFrame
Columns: [tconst, titleType, primaryTitle, originalTitle, isAdult, startYear, endYear, runtimeMinutes, genres]
Index: []

In [10]:
is_documentary = df['genres'].str.contains('documentary',case=False)
df = df[~is_documentary]

In [ ]:
# file_2 = 'https://datasets.imdbws.com/title.akas.tsv.gz'
# akas = pd.read_csv(file_2, sep='\t', low_memory=False)

In [11]:
# keepers =df['tconst'].isin(akas['titleid'])
# df_2.head(10)

In [ ]:
# df_2 = df_2.replace({'\\N':np.nan})

In [ ]:
# df_2.loc[(df_2['region'] == 'US')]

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 23158 entries, 108535 to 9417116
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          23158 non-null  object
 1   titleType       23158 non-null  object
 2   primaryTitle    23158 non-null  object
 3   originalTitle   23158 non-null  object
 4   isAdult         23158 non-null  object
 5   startYear       23158 non-null  object
 6   endYear         23158 non-null  object
 7   runtimeMinutes  23158 non-null  object
 8   genres          23158 non-null  object
dtypes: object(9)
memory usage: 1.8+ MB

In [4]:
file_3 = 'https://datasets.imdbws.com/title.ratings.tsv.gz'

df_2 = pd.read_csv(file_3 , sep='\t' , low_memory=False)

df_2.head(10)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1923
1  tt0000002            5.8       260
2  tt0000003            6.5      1738
3  tt0000004            5.6       175
4  tt0000005            6.2      2553
5  tt0000006            5.1       175
6  tt0000007            5.4       797
7  tt0000008            5.4      2069
8  tt0000009            5.3       200
9  tt0000010            6.9      6984

In [5]:
df_2.dropna(inplace=True)

In [7]:
df_2.isna().sum()

tconst           0
averageRating    0
numVotes         0
dtype: int64

In [6]:
df_2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1253454 entries, 0 to 1253453
Data columns (total 3 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   tconst         1253454 non-null  object
 1   averageRating  1253454 non-null  float64
 2   numVotes       1253454 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 28.7+ MB

In [8]:
import os
os.makedirs('Data/',exist_ok=True) 
# Confirm folder created
os.listdir("Data/")

[]

In [10]:
df_2.to_csv("Data/title_basics.csv.gz",compression='gzip',index=False)

In [11]:
df_2 = pd.read_csv("Data/title_basics.csv.gz", low_memory = False)
df_2.head(10)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1923
1  tt0000002            5.8       260
2  tt0000003            6.5      1738
3  tt0000004            5.6       175
4  tt0000005            6.2      2553
5  tt0000006            5.1       175
6  tt0000007            5.4       797
7  tt0000008            5.4      2069
8  tt0000009            5.3       200
9  tt0000010            6.9      6984